Repository: autohotkey-docs-translation/v1-pt-br
Catalog: omegat/project_save.tmx
Source language: en
Languages: pt_br

source: " 5 + MyVar2
pt_br: " 5 + MinhaVar2

source: "What is indentation?" you ask?
pt_br: “O que é indentação?”, você pergunta.

source: "Applies to AutoHotkey {0} and later":true,
pt_br: "Applies to AutoHotkey {0} and later":"Aplica-se a AutoHotkey {0} e posterior",

source: "Applies to:\nAutoHotkey_L Revision {0} and later\nAutoHotkey v1.0.90.00 and later":true,
pt_br: "Applies to:\nAutoHotkey_L Revision {0} and later\nAutoHotkey v1.0.90.00 and later":"Aplica-se a:\nAutoHotkey_L Revision {0} e posterior\nAutoHotkey v1.0.90.00 e posterior",

source: "Back to top":true,
pt_br: "Back to top":"Voltar ao início",

source: "Built-in Functions":true,
pt_br: "Built-in Functions":"Funções Nativas",

source: "Built-in Variables":true,
pt_br: "Built-in Variables":"Variáveis Nativas",

source: "C":true,
pt_br: "C":"S",

source: "Change the font size":true,
pt_br: "Change the font size":"Mudar o tamanho da fonte",

source: "Change the language":true,
pt_br: "Change the language":"Mudar o idioma",

source: "Change the version":true,
pt_br: "Change the version":"Mudar a versão",

source: "Commands":true,
pt_br: "Commands":"Comandos",

source: "Content tab":true,
pt_br: "Content tab":"Guia de Sumário",

source: "Control Flow Statements":true,
pt_br: "Control Flow Statements":"Instruções de Fluxo de Controle",

source: "C̲ontent":true,
pt_br: "C̲ontent":"S̲umário",

source: "Declarations":true,
pt_br: "Declarations":"Declarações",

source: "Delicious", "Price":
pt_br: "Delicioso", "Preco":

source: "Directives":true,
pt_br: "Directives":"Diretivas",

source: "Download code":true,
pt_br: "Download code":"Baixar código",

source: "Edit this document on GitHub":true,
pt_br: "Edit this document on GitHub":"Editar este documento no GitHub",

source: "Filter":true,
pt_br: "Filter":"Filtro",

source: "Go back":true,
pt_br: "Go back":"Voltar",

source: "Go forward":true,
pt_br: "Go forward":"Encaminhar",

source: "Go to previous/next occurrence":true,
pt_br: "Go to previous/next occurrence":"Ir para ocorrência prévia/próxima",

source: "Go to the homepage":true,
pt_br: "Go to the homepage":"Ir para a página inicial",

source: "Hide or show the sidebar":true,
pt_br: "Hide or show the sidebar":"Esconder ou mostrar a barra lateral",

source: "Highlight keywords":true,
pt_br: "Highlight keywords":"Destacar palavras-chave",

source: "If at first you don't succeed, try, try, try again." - Hickson, William E.
pt_br: “Se de começo você não conseguir, tente, tente, tente novamente.” — William E. Hickson.

source: "Index tab":true,
pt_br: "Index tab":"Guia de Índice",

source: "In̲dex":true,
pt_br: "In̲dex":"Í̲ndice",

source: "N":true,
pt_br: "N":"I",

source: "Open the help settings":true,
pt_br: "Open the help settings":"Abrir as configurações de ajuda",

source: "Operators":true,
pt_br: "Operators":"Operadores",

source: "Print this document":true,
pt_br: "Print this document":"Imprimir este documento",

source: "S":true,
pt_br: "S":"U",

source: "Search tab":true,
pt_br: "Search tab":"Guia de Pesquisar",

source: "Search":true,
pt_br: "Search":"Pesquisar",

source: "Select code":true,
pt_br: "Select code":"Selecionar código",

source: "Skip navigation":true,
pt_br: "Skip navigation":"Pular navegação",

source: "S̲earch":true,
pt_br: "S̲earch":"Pesqu̲isar",

source: "Use the dark or light theme":true,
pt_br: "Use the dark or light theme":"Usar o tema escuro ou claro",

source: "Yellow", "Taste":
pt_br: "Amarelo", "Gosto":

source: "a custom function",
pt_br: "uma função personalizada",

source: "commands/_CommentFlag.htm":"the default comment flag (semicolon)",
pt_br: "commands/_CommentFlag.htm":"o sinalizador padrão de comentários (ponto-e-vírgula)",

source: "commands/_EscapeChar.htm":"the default escape character (accent)",
pt_br: "commands/_EscapeChar.htm":"o caractere padrão de escape (acento)",

source: "commands/_EscapeChar.htm#Delimiter":"the default delimiter character (comma)",
pt_br: "commands/_EscapeChar.htm#Delimiter":"o caractere padrão de delimitação (vírgula)",

source: "commands/_EscapeChar.htm#DerefChar":"the default dereference character (percent)",
pt_br: "commands/_EscapeChar.htm#DerefChar":"o caractere padrão de desreferenciação (porcentagem)",

source: "en":true,
pt_br: "en":"pt",

source: "https://github.com/Lexikos/AutoHotkey_L-Docs/edit/master/docs/":true,
pt_br: "https://github.com/Lexikos/AutoHotkey_L-Docs/edit/master/docs/":"https://github.com/ahkscript/AHK-Docs_PT-BR/edit/master/target/docs/",

source: "math functions and operators",
pt_br: "Funções e operadores matemáticos",

source: "the & operator",
pt_br: "o operador &",

source: "the ** operator",
pt_br: "o operador **",

source: "the << operator",
pt_br: "o operador <<",

source: "the >> operator",
pt_br: "o operador >>",

source: "the Unicode version of AutoHotkey"
pt_br: "a versão Unicode do AutoHotkey"

source: "the ^ operator",
pt_br: "o operador ^",

source: "the expression syntax or a custom function",
pt_br: "a sintaxe da expressão ou uma função personalizada",

source: "the | operator",
pt_br: "o operador |",

source: "the ~ operator",
pt_br: "o operador ~",

source: #1 (if true) → #1.1 → #1.2 → #3; or #1 (if false) → #2 (else) → #2.1 → #3.
pt_br: #1 (se verdadeiro) → #1.1 → #1.2 → #3; ou #1 (se falso) → #2 (senão) → #2.1 → #3.

source: #1 is a conditional statement, also known as an if statement; that is, we execute its body (#1.1 - #1.2) only if a condition is met.
pt_br: #1 é uma instrução condicional, também conhecida como uma instrução com if; isto é, nós executamos seu corpo (#1.1 - #1.2) somente se uma condição específica é atingida.

source: #2 is an else statement; we execute its body (#2.1) only if the condition of a previous if statement (#1) is not met.
pt_br: #2 é uma instrução com else; nós executamos seu corpo (#2.1) somente se a condição de uma instrução com if anterior não tiver sido atingida.

source: #IfWinActive Untitled - Notepad
pt_br: #IfWinActive Sem título - Bloco de Notas

source: #IfWinActive Untitled - Paint
pt_br: #IfWinActive Sem título - Paint

source: %AssociatedVar%
pt_br: %VariavelAssociada%

source: (For further explanation of surrogate pairs and methods of encoding or decoding them, search the Internet.)
pt_br: (Para explicações mais detalhadas dos pares substitutos e seus métodos de codificação e decodificação, pesquise na Internet.)

source: (For the full list of symbols, see the Hotkey page)
pt_br: (Para a lista completa de símbolos, veja a página sobre Hotkeys.)

source: (Objects are always considered true.)
pt_br: (Objetos sempre são considerados verdadeiros.)

source: 1 - The Basics
pt_br: 1 - Primeiros passos

source: 1) "b" when you type "a"; 2) uppercase "B" when you type uppercase "A"; and 3) Ctrl+B when you type Ctrl+A.
pt_br: 1) “b” quando você pressiona “a”; 2) “B” maiúsculo quando você pressiona “A” maiúsculo; e 3) Ctrl+B quando você digita Ctrl+A.

source: 1) Start Menu appearance during Win keystrokes (LWin/RWin); 2) menu bar activation during Alt keystrokes.
pt_br: 1) a aparição do Menu Iniciar durante os pressionamentos de tecla envolvendo a tecla Win (LWin/RWin); 2) a ativação da barra de menu ao enviar pressionamentos de tecla envolvendo a tecla Alt.

source: 2 - Hotkeys & Hotstrings
pt_br: 2 - Hotkeys e Hotstrings

source: 3 - Sending Keystrokes
pt_br: 3 - Enviando pressionamentos de teclas

source: 4 - Running Programs & Websites
pt_br: Executando programas e abrindo sites da web

source: 4th mouse button.
pt_br: O 4º botão do mouse.

source: 5 - Commands vs. Functions()
pt_br: 5 - Comandos x Funções()

source: 5th mouse button.
pt_br: O 5º botão do mouse.

source: 6 - Variables
pt_br: 6 - Variáveis

source: 64-bit binary floating-point numbers (the double or binary64 format of the IEEE 754 international standard).
pt_br: Números de ponto flutuante 64 bits binários (o formato double ou binary64 do padrão internacional 754 do IEEE.

source: 64-bit signed integers (int64).
pt_br: Inteiros 64 bits (signed, int64).

source: 7 - Objects
pt_br: 7 - Objetos

source: 8 - Other Helpful Goodies
pt_br: 8 - Outras utilidades

source: :*:acheiv::achiev
pt_br: :*:trnasf::transf

source: :*:adquir::acquir
pt_br: ::cjg::coisa julgada

source: :*:agravat::aggravat
pt_br: ::xplo::exploração

source: :*:allign::align
pt_br: :*:fazelo::fazê-lo

source: :*:ftw::Free the whales
pt_br: :*:slm::Salve os leões marinhos

source: ::achievment::achievement
pt_br: :*:todso::todos

source: ::acquaintence::acquaintance
pt_br: ::brasil::Brasil

source: ::ameria::America
pt_br: ::mesom::mesmo

source: ::aquisition::acquisition
pt_br: ::cgj::coisa julgada

source: ::btw::
pt_br: ::tdb::

source: ::btw::by the way
pt_br: ::flni::falando nisso

source: ::ftw::Free the whales
pt_br: ::sab::Salve as baleias

source: ::msg::You typed msg in MSPaint!
pt_br: ::msg::Você digitou "msg" dentro do Paint!

source: ::msg::You typed msg in Notepad
pt_br: ::msg::Você digitou "msg" dentro do Bloco de Notas.

source: :SP:btw::by the way
pt_br: :SP:flni::falando nisso

source: ; Add the value of a variable to another (expression).
pt_br: ; Somar o valor de uma variável ao de outra (expressão).

source: ; Allows a script's hidden main window to be detected.
pt_br: ; Permite que a janela principal oculta de um script seja detectada.

source: ; Any window that isn't Untitled - Notepad
pt_br: ; Qualquer janela que não seja "Sem título - Bloco de Notas"

source: ; Append a variable to the end of another (expression).
pt_br: ; Acrescentar a variável ao final de outra (expressão).

source: ; Assign a number to a variable (expression).
pt_br: ; Atribuir um número a uma variável (expressão).

source: ; Assign a variable to another (expression).
pt_br: ; Atribuir o valor de uma variável a outra variável (expressão).

source: ; Assign a variable to another (legacy).
pt_br: ; Atribuir o valor de uma variável a outra variável (forma legada).

source: ; Assign some text to a variable (legacy).
pt_br: ; Atribuir um pedaço de texto a uma variável (forma legada).

source: ; Assigns a variable to another with some extra text (expression).
pt_br: ; Atribuir o valor de uma variável a outra com um texto extra (expressão).

source: ; Assigns a variable to another with some extra text (legacy).
pt_br: ; Atribuir o valor de uma variável a outra com um texto extra (forma legada).

source: ; Avoids the need to specify the full path of the file below.
pt_br: ; Evita a necessidade de especificar o caminho completo do arquivo abaixo.

source: ; Both of these send CTRL+S
pt_br: ; Ambos enviam CTRL+S

source: ; Break out of this loop.
pt_br: ; Libertar-se deste loop.

source: ; CORRECT
pt_br: ; CERTO

source: ; CTRL+B hotkey
pt_br: ; Hotkey CTRL+B

source: ; CTRL+N hotkey
pt_br: ; Hotkey CTRL+N

source: ; Copies the selected text. ^c could be used as well, but this method is more secure.
pt_br: ; Copia o texto selecionado. ^c também poderia ser usado, mas aquele método é mais seguro.

source: ; Correct
pt_br: ; Certo

source: ; Correct. Control is omitted.
pt_br: ; Correto. O controle foi omitido.

source: ; Correct. Control is specified.
pt_br: ; Correto. O controle foi especificado.

source: ; Create a new reference to the same object
pt_br: ; Criar uma nova referência para o mesmo objeto

source: ; Create an object and store first reference
pt_br: ; Criar um objeto e armazenar sua primeira referência

source: ; Disable Alt+key shortcuts for the IME.
pt_br: ; Desabilitar atalhos com Alt+tecla para o IME.

source: ; End this thread so that the one underneath will resume and see the change made by the line above.
pt_br: ; Finalize esse fio de execução de tal forma que o que está debaixo irá retomar e virá a mudança feita pela linha acima.

source: ; For explanation, see #NoEnv.
pt_br: ; Para explicações, veja #NoEnv.

source: ; For the correct result, this must be evaluated by the resource being executed,
pt_br: ; Para o resultado correto, este precisa ser determinado pelo recurso que estiver em execução,

source: ; If No, stop the code from going further.
pt_br: ; Se não, impeça o código de seguir adiante.

source: ; If one method doesn't work in your program, please try the other.
pt_br: ; Se um método não funciona em seu programa, tente o outro.

source: ; Incorrect: Parameters are mismatched.
pt_br: ; Incorreto: os parâmetros não combinam.

source: ; Keep it down for one second.
pt_br: ; Segura a tecla por um segundo (1000 milissegundos).

source: ; Notepad
pt_br: ; Bloco de Notas

source: ; Notice the ! between the curly brackets? That's because if it wasn't, AHK would press the ALT key.
pt_br: ; Notou o ! entre as chaves? É porque, se não houvesse chaves, AHK apertaria a tecla ALT em vez de enviar o ponto de exclamação.

source: ; Otherwise, the user picked yes.
pt_br: ; Do contrário, o usuário escolheu sim.

source: ; Otherwise:
pt_br: ; Do contrário:

source: ; Press Ctrl+Alt+P to pause. Press it again to resume.
pt_br: ; Pressione Ctrl+Alt+P para pausar. Pressione de novo para retomar.

source: ; Press down the up-arrow key.
pt_br: ; Pressiona e segura a tecla SETA PARA CIMA.

source: ; Prevent main window from hiding.
pt_br: ; Impede a janela principal de ser ocultada.

source: ; Prevent owned window from minimizing.
pt_br: ; Impede a minimização de uma janela criada pelo script.

source: ; Prevents the status bar from showing a mouse-hover link instead of "Done".
pt_br: ; Impede que a barra de status exiba um link de sobreposição de cursor em vez de "Concluído".

source: ; Release the first reference
pt_br: ; Libera a primeira referência

source: ; Release the second reference; object is deleted
pt_br: ; Libera a segunda referência; o objeto é excluído

source: ; Release the up-arrow key.
pt_br: ; Solta a tecla SETA PARA CIMA.

source: ; Reload.
pt_br: ; Recarrega.

source: ; Remap CapsLock to LCtrl in a way compatible with IME.
pt_br: ; Remapear CapsLock para LCtrl de uma forma compatível com o IME.

source: ; Replace 159 with the value discovered above. Replace FF (if needed) with the
pt_br: ; Substitua 159 com o valor descoberto acima. Substitua FF (se necessário) com a

source: ; Replace 159 with your key's value.
pt_br: ; Substitua 159 com o valor da sua tecla.

source: ; Replaces "btw" with "by the way" as soon as you press an default ending character.
pt_br: ; Substitui “btw” por “by the way” assim que você pressionar o caractere de terminação padrão.

source: ; Replaces "btw" with "by the way" without needing an ending character.
pt_br: ; Substitui “btw” por “by the way” sem que você precise pressionar um caractere de terminação, ou seja, tão logo você pressione a última tecla da abreviatura (w).

source: ; Requires AutoHotkey v1.1.26+, and the keyboard hook must be installed.
pt_br: ; Requer AutoHotkey v1.1.26+ e o gancho de teclado deve estar instalado.

source: ; Reset in preparation for the next press of this hotkey.
pt_br: ; Recomeçar em preparação ao próximo pressionamento desta hotkey.

source: ; Run Notepad when you press CTRL+N.
pt_br: ; Abrir o Bloco de Notas quando você pressionar CTRL+N.

source: ; Run a program. Note that most programs will require a FULL file path:
pt_br: ; Abre/executa/roda um programa. Note que a maioria dos programas exigirá um caminho completo do arquivo:

source: ; Run a website:
pt_br: ; Abrir um site:

source: ; Run some websites:
pt_br: ; Abrir alguns sites:

source: ; Run the "My Documents" folder using a built-in variable:
pt_br: ; Abrir a pasta "Meus documentos" usando uma variável nativa:

source: ; Same as above, but with the ENTER key. AHK would type out "Enter" if
pt_br: ; Mesmo caso acima, mas com a tecla ENTER. AHK iria digitar "Enter" se

source: ; See Send {vkXXscYYY} for more details.
pt_br: ; Veja Send {vkXXscYYY} para mais detalhes.

source: ; Several programs do not need a full path, such as Windows-standard programs:
pt_br: ; vários programas não requerem um caminho completo, como os programas-padrão do Windows:

source: ; Show "over-full" precision
pt_br: ; Mostrar precisão "além do máximo"

source: ; Signal that thread's loop to stop.
pt_br: ; Sinalize o loop do fio de execução para parar.

source: ; Some examples showing when to use percents and when not:
pt_br: ; Alguns exemplos mostrando quando usar "%" e quando não:

source: ; Subtract the value of a variable from another (expression).
pt_br: ; Subtrair o valor de uma variável do de outra (expressão).

source: ; Test hotkey:
pt_br: ; Testar hotkey:

source: ; The user signaled the loop to stop by pressing Win-Z again.
pt_br: ; O usuário sinalizou o loop para parar quando aquele pressionou Win-Z de novo.

source: ; These are commands:
pt_br: ; Estes são comandos:

source: ; These are functions:
pt_br: ; Estas são funções:

source: ; This banana has been pickled. Eww.
pt_br: ; Esta banana ficou imersa em vinagre. Argh.

source: ; This ends the hotkey. The code below this will not be executed when pressing the hotkey.
pt_br: ; Isto conclui a hotkey. O código que vier abaixo de 'return' não será executado quando você pressionar a hotkey.

source: ; This is how you hold one key down and press another key (or keys).
pt_br: ; É assim que você segura uma tecla e pressiona outra(s)

source: ; This means an underlying thread is already running the loop below.
pt_br: ; Isto significa que o fio de execução subjacente já está executando o loop abaixo.

source: ; This prevents owned GUI windows (but not dialogs) from automatically minimizing:
pt_br: ; Isto impede janelas de GUIs (mas não janelas de diálogo) de automaticamente minimizarem:

source: ; This prevents the main window from hiding on minimize:
pt_br: ; Isto impede a janela principal de ser oculta ou minimizar:

source: ; Untitled - Notepad
pt_br: ; Sem título - Bloco de Notas

source: ; Update this to reflect the script's name (case sensitive).
pt_br: ; Mude isto para refletir o nome do script (diferencia maiúsculas de minúsculas).

source: ; Variable inside a command that uses InputVar and OutputVar.
pt_br: ; Variável dentro de um comando que usa InputVar e OutputVar (variável de entrada e variável de saída).

source: ; Variable inside a command.
pt_br: ; Variável dentro de um comando.

source: ; Variable inside a function. This is always an expression.
pt_br: ; Variável dentro de uma função. Isto é sempre uma expressão.

source: ; WRONG
pt_br: ; ERRADO

source: ; When making a hotkey...
pt_br: ; Ao criar uma hotkey...

source: ; Whenever an IF has parentheses, it'll be an expression. So no percent signs.
pt_br: ; Toda vez que uma instrução com If contiver parênteses, ela será uma expressão. Então nada de sinais de porcentagem.

source: ; Win+Spacebar
pt_br: ; Win+Espaço

source: ; Without parentheses, the IF is legacy. However, only variables on the 'right side' need percent signs.
pt_br: ; Sem os parênteses, o If fica na forma legada. Contudo, somente as variáveis no 'lado direito' precisam de sinais de porcentagem.

source: ; Wraps the selected text in BBCode tags to make it bold in a forum.
pt_br: ; Envolve o texto selecionado em tags de BBCode para torná-lo negrito em um fórum.

source: ; Wrong
pt_br: ; Errado

source: ; it wasn't wrapped in curly brackets.
pt_br: ; a palavra não estivesse envolta em chaves.

source: ; key's virtual key, which can be discovered in the first column of the Key History screen.
pt_br: ; chave virtual da tecla, que pode ser descoberta na primeira coluna da tecla do Histórico de Teclas.

source: ; not an #include (unless the #include was merged into the script by Ahk2Exe):
pt_br: ; não um #include (a não ser que o #include tenha sido mesclado ao script pelo Ahk2Exe):

source: ; try various milliseconds
pt_br: ; tente vários milissegundos

source: Code blocks are lines of code surrounded by little curly brackets ({ and }).
pt_br: Blocos de código são linhas de código circundadas por pequenas chaves ({ e }).

source: Concepts and conventions:
pt_br: Conceitos e convenções:

source: Escaped percent signs (`%) and percent signs in quoted literal strings have no special meaning (they are interpreted as literal percent signs).
pt_br: Sinais de porcentagem escapados (`%) e sinais de porcentagem dentro de strings literais entre aspas não têm significado especial (eles são interpretados como sinais de porcentagem literais).

source: FileRead, FileAppend, FileOpen() and the File object provide ways of reading and writing text in files with a specific encoding.
pt_br: Os comandos FileRead, FileAppend, a função FileOpen() e o Objeto arquivo fornecem meios de ler e escrever texto com uma codificação específica em arquivos.

source: GNU General Public License
pt_br: Licença Geral Pública GNU

source: In section 5 we'll talk about why it doesn't work as you might expect and what you can do instead.
pt_br: Na seção 5 vamos falar sobre o porquê de não funcionar do jeito que você espera e o que você pode fazer para consertar.

source: Joystick remapping: Methods of sending keystrokes and mouse clicks with a joystick.
pt_br: Remapeamento de joystick: métodos para enviar pressionamentos de teclas e cliques do mouse com um joystick.

source: Joystick-To-Mouse script:
pt_br: Script de joystick-para-mouse:

source: Lots and lots of them.
pt_br: Muitas e muitas delas.

source: Menu masking is disabled.
pt_br: Menu masking é desabilitado.

source: MsgBox, 4,, Would you like to continue?
pt_br: MsgBox, 4,, Gostaria de continuar?

source: Numbers (integers and floating-point numbers)
pt_br: Números (inteiros e números de ponto flutuante)

source: Objects are a way of organizing your data for more efficient usage.
pt_br: Objetos são uma forma de organizar seus dados para um uso mais eficiente.

source: Run tries both.
pt_br: Run tenta executar ambos.

source: RunWait %ComSpec% /c dir > C:\My Temp File.txt
pt_br: RunWait %ComSpec% /c dir > C:\Meu Arquivo Temporario.txt

source: Script compatibility - AutoHotkey 1.0 users read this
pt_br: Compatibilidade de scripts — usuários do AutoHotkey 1.0 devem ler isto

source: Scripting language:
pt_br: Linguagem de confecção de scripts:

source: SetFormat's slow mode forces the assignment of a pure number to immediately convert that number to a string.
pt_br: O modo lento do SetFormat força a atribuição de um número puro para imediatamente converter aquele número em uma string.

source: SetStoreCapsLockMode is ignored; that is, the state of CapsLock is not changed.
pt_br: SetStoreCapsLockMode é ignorado; isto é, o estado da tecla CapsLock não é alterado.

source: SoundGet, SoundSet, SoundGetWaveVolume and SoundSetWaveVolume behave differently on Vista and later than on earlier versions of Windows.
pt_br: SoundGet, SoundSet, SoundGetWaveVolume e SoundSetWaveVolume comportam-se de maneira diferente no Windows Vista e posteriores em relação a versões anteriores do Windows.

source: Strings (text)
pt_br: Strings (texto)

source: The WinTitle Parameter & the Last Found Window.
pt_br: O parâmetro WinTitle & a Última Janela Encontrada.

source: User Account Control (UAC) is a common cause of problems, especially when moving from Windows XP/Vista/7 to Vista/7/8/10.
pt_br: O Controle de Conta do Usuário é uma causa comum de problemas, especialmente quando se está migrando do Windows XP/Vista/7 para Vista/7/8/10.

source: Variable Capacity and Memory:
pt_br: Capacidade de uma Variável e Memória Usada:

source: Variables are like little post-it notes that hold some information.
pt_br: Variáveis são como pequenas notas escritas em post-its que contêm informações.

source: Variables:
pt_br: Variáveis:

source: create a script file → add some hotkeys → run the script file.
pt_br: crie um arquivo de script → adicione algumas teclas de atalho (hotkeys) → execute o arquivo do script.

source: list of built-in variables.
pt_br: lista de variáveis nativas.

source: variables, functions
pt_br: variáveis, funções
